create_clock -name CLK50 -period  20.000 [get_ports {CLK50}]
create_clock -name TCK   -period 100.000 [get_ports {TCK}]
create_clock -name CLK   -period  50.000 [get_nets {U_PLL|altpll_component|auto_generated|wire_pll1_clk[0]}]
create_clock -name CLK   -period  60.000 [get_nets {U_PLL|altpll_component|auto_generated|wire_pll1_clk[1]}]
create_clock -name LOCK  -period 100.000 [get_nets {U_PLL|altpll_component|auto_generated|locked}]
derive_pll_clocks
derive_clock_uncertainty
set_false_path   -to [get_ports {RESOUT_N}]
set_input_delay  -clock {CLK50}  5 [get_ports {RES_N}]
set_output_delay -clock {CLK  }  0 [get_ports {RESOUT_N}]
set_input_delay  -clock {TCK  }  5 [get_ports {TRSTn}]
set_input_delay  -clock {TCK  }  5 [get_ports {TDI TMS}]
set_output_delay -clock {TCK  }  5 [get_ports {TDO}]
set_input_delay  -clock {CLK  } 10 [get_ports {GPIO0[*] GPIO1[*] GPIO2[*]}]
set_output_delay -clock {CLK  } 10 [get_ports {GPIO0[*] GPIO1[*] GPIO2[*]}]
set_input_delay  -clock {CLK  } 10 [get_ports {RXD}]
set_output_delay -clock {CLK  } 10 [get_ports {TXD}]
set_input_delay  -clock {CLK  } 10 [get_ports {I2C0_SCL I2C0_SDA I2C0_INT1 I2C0_INT2}]
set_output_delay -clock {CLK  } 10 [get_ports {I2C0_SCL I2C0_SDA}]
set_input_delay  -clock {CLK  } 10 [get_ports {I2C1_SCL I2C1_SDA}]
set_output_delay -clock {CLK  } 10 [get_ports {I2C1_SCL I2C1_SDA}]
set_input_delay  -clock {CLK  } 10 [get_ports {SPI_MISO}]
set_output_delay -clock {CLK  } 10 [get_ports {SPI_CSN[*] SPI_SCK SPI_MOSI}]
set_input_delay  -clock {CLK  } 20 [get_ports {SDRAM_DQ[*]}]
set_output_delay -clock {CLK  } 20 [get_ports {SDRAM_DQ[*] SDRAM_ADDR[*]}]
set_output_delay -clock {CLK  } 20 [get_ports {SDRAM_CSn SDRAM_RASn SDRAM_CASn SDRAM_WEn}]
set_output_delay -clock {CLK  } 20 [get_ports {SDRAM_CKE SDRAM_BA[*] SDRAM_DQM[*]}]
set_output_delay -clock {CLK  } 10 [get_ports {SDRAM_CLK}]
